{
    "items": [
        {
            "title": "Shop System",
            "subtitle": "<b style='color: rgb(255, 0, 0);'>Laravel</b> and Php",
            "src": "media/img-1.a1f6d022.jpg",
            "Demo_href": "http://shops1.herokuapp.com/public/login",
            "Project_Description": "system with authorization to save shops items and get data from it ",
            "video_src": "",
            "Github_href": "https://github.com/abanoubsamirnaguib/pos-app/",
            "Project_Details": [
                "Login system with muti-auth system using Laratrust Laravel package .",
                "Multi language (Arabic - English) interface .",
                "Navbar with the name of login member and the date of register and logout button .",
                "Dashboard with most important information like categories , products , clients and users .",
                "Side bar menu with all sections  and you can minimize it .",
                "In Category section you can search for Categories with Laravel ORM queries using Model system.",
                "In Category section, table with all category containig related products using Laravel one-many relationship .  ",
                "In products section you can search for products and search inside specific category .",
                "In clients section table you can see all clients and add order for every one and you can call them.",
                "In add order page you can chooses between category and  choose product of each category with quantity of order  .",
                "In add order page you can see previous order using laravel many to many relationship .",
                "In order page you can see all orders with clients and you can see order details and print the table of order details using printThis.js  .",
                "In  order page you can see all user and can add admin and super admin .",
                "In all pages you can search and add , edit  , delete ,if you are super admin and you can mange roles by Laratrust Laravel package in database .",
                "You can add admin if you are super admin .",
                "Using seeding and laravel migration to fill data in website database .",
                "Using admin LTE template and some modification on it .",
                "Using Astrotomic laravel-translatable package to manage translation of app "
            ],
            "languages_Used": [
                "php",
                "laravel 8",
                "blade template",
                "Html",
                "Css",
                "Bootstrap",
                "RESTful API"
            ],
            "links": {}
        },
        {
            "title": "Corna Api",
            "subtitle": "<b style='color: rgb(255, 0, 0);'>Angular </b> And Api",
            "Project_Description": "Web-site that count crona Cases from API and get details of every country cases",
            "src": "media/img-1.b96b5edf.jpg",
            "video_src": "https://www.youtube.com/embed/x_j_Oc7JWUY",
            "Github_href": "https://github.com/abanoubsamirnaguib/testCrona.github.io",
            "Demo_href": "https://abanoubsamirnaguib.github.io/testCrona.github.io/",
            "Project_Details": [
                " Get all Total Confirmed Corona Cases from Api that updated every minute.",
                " Get New Confirmed and New Deaths and New Recovered Every day from API.",
                " Get total Confirmed and total Deaths and total Recovered Every day from API.",
                " Get the Date Of the day.",
                " Using Angular SPA that Loading page once and make the site as Web Application. ",
                " Beautiful animated Design.",
                " Animated Button.",
                " A table with all the sick details for each Country.",
                " Search Input with Country Code or Country Name.",
                " Indicator for the word to be searched Using Angular two way Binding.",
                " Table of New Confirmed and New Deaths and New Recovered and total Confirmed and total Deaths and total Recovered of all Country Every day from API.",
                " Change the order of each column in the table, ascending or descending.",
                " By Clicking on the name of country, the country details will appear.",
                " Table Contents Updated Every Day",
                " Details of how to protect yourself and the Symptoms in separated pages .",
                " Form to contact US with a validation of all inputs ."
            ],
            "languages_Used": [
                "Html",
                "Css",
                "Bootstrap",
                "javascript",
                "typescript",
                "Angular 8",
                "RESTful API"
            ],
            "links": {}
        },
        {
            "title": "Library Book",
            "subtitle": "Html, Css and <b style='color: rgb(255, 0, 0);'>javascript </b>",
            "Project_Description": "website for books store in laboratory and you can add and modify books details",
            "src": "media/img-1.8b6be712.jpg",
            "video_src": "https://www.youtube.com/embed/388xX5k7nh8",
            "Github_href": "https://abanoub-a001e.web.app/",
            "Demo_href": "https://abanoub-a001e.web.app/",
            "Project_Details": [
                "Fantastic Website design to add books in laboratory.",
                "Form to add book name, author, salary, description and photo.",
                "Add book information with beautiful strange button in the left with joyful picture.",
                "Search form in real time without submitting that search book by name .",
                "Beautiful card indicate book details.",
                "Edit button that convert book details to input fields then you can save it and get the modified details.  ",
                "Don’t need to reload page to make the modification, its work by JavaScript Dom  .",
                "Very fast editing form without any backend work.",
                "Remove book card without needing to reload page by JavaScript Dom  .",
                "Saving the information in browser local host, so you can back to it any time.",
                "Page uploaded on firebase host "
            ],
            "languages_Used": [
                "Html",
                "Css",
                "Bootstrap",
                "javascript"
            ],
            "links": {}
        },
        {
            "title": "Skills Hub",
            "subtitle": "<b style='color: rgb(255, 0, 0);'> Laravel </b> and Php",
            "Project_Description": "Education website to put and make tests in different categories and get students results ",
            "src": "media/img-1.c70a817c.jpg",
            "video_src": "https://www.youtube.com/embed/tgbNymZ7vqY",
            "Github_href": "https://github.com/abanoubsamirnaguib/skill-hub",
            "Demo_href": "http://skills-hub-abanoub.herokuapp.com/public/SkillsHub/home",
            "Project_Details": [
                "login and sing up system and send verify mail to user . ",
                "Category button contains all category.",
                "Breed crump header in every page ",
                "Paginate in every category branch",
                "Sidebar with all categories and number of categories in every branch.",
                "Every category has 3 exams ",
                "You can enter the exam one time when you login ",
                "Sidebar with number of questions and exam time .",
                "7 question foe very exam and time estimation.",
                "Profile button in navbar to get your marks in all exams.",
                "Contact button to send email to admin.",
                "If you are admin you will get dashboard button that take you to dashboard .",
                "In dashboard you can see sidebar with all information ",
                "Get all student and email status and each student exams ",
                "You can open or close any exam for student and get student marks",
                "Get all skills and modify it or add new one .",
                "Get all categories and modify it or add new one.",
                "Get all exams and modify it or add new one , and show and modify questions.",
                "Get all admins and control admin level or delete him or add new admin .",
                "Beautiful design with Admin-LTE template panel . "
            ],
            "languages_Used": [
                "php",
                "laravel 8",
                "blade template",
                "Html",
                "Css",
                "Bootstrap",
                "RESTful API"
            ],
            "links": {}
        },
        {
            "title": "Visual Design",
            "subtitle": "HTML , CSS ,<b style='color: rgb(255, 0, 0);'> Bootstrap </b> <br> For Modern Designs",
            "Project_Description": "Amazing websites For Modern design frontend Templates",
            "src": "media/img-1.532b98fd.jpg",
            "video_src": "https://www.youtube.com/embed/tgbNymZ7vqY",
            "Github_href": "https://i9igpzpdsgkg0b3uk1woma.on.drv.tw/nti/Task7",
            "Demo_href": "https://i9igpzpdsgkg0b3uk1woma.on.drv.tw/nti/Task5/",
            "Project_Details": [
                "Amazing websites with header and footer .",
                "Separated Sections with details .",
                "Animated buttons .",
                "Modern design .",
                "Responsive design with all devices sizes ."
            ],
            "languages_Used": [
                "Html",
                "Css",
                "Bootstrap",
                "javascript"
            ],
            "links": {
                "link1": "https://i9igpzpdsgkg0b3uk1woma.on.drv.tw/nti/Task4/task%204/",
                "link2": "https://i9igpzpdsgkg0b3uk1woma.on.drv.tw/nti/Task%203/",
                "link3": "https://i9igpzpdsgkg0b3uk1woma.on.drv.tw/nti/Task7"
            }
        },
        {
            "title": "php websites",
            "subtitle": "pure php and mysql ",
            "Project_Description": "pure php websites that get data from mysql database and do some process ",
            "src": "media/img-1.1c7b924e.jpg",
            "video_src": "https://www.youtube.com/embed/tgbNymZ7vqY",
            "Github_href": "https://github.com/abanoubsamirnaguib/phpv1",
            "Demo_href": "http://evening-basin-25603.herokuapp.com/login.php",
            "Project_Details": [
                "pure Php database company website  </br>- login system to see the information . </br>- guard with middleware ,you can’t access information without login .  </br>- home page with “welcome user name” . </br>- navbar has all details. </br>- in account section you can modify your information and submit it using php connection to database that modify the new account information and backing to page with new information. </br>- more dropdown menu that contain all pages of company information . </br>- all clients credit bigger than 20000 using MySQL query to get information . </br>- get customer by id that start from 103 . </br>- get customer by name and you can type first letter only using like MySQL  statement  . </br>- get customer by city ordered by name  and you can choose the city and get the customers’ names using where and order-by MySQL  statements  . </br>- most number of ordered products using join MYSQL statement to join between two tables . </br>- join one table with itself to get employee with its manager . </br>- get the quantity of products that between 500-5000 .",
                "simple php projects ( calculator  , Electricity bill , student grades , number root ). ",
                "simple php bank loans calculator ",
                "simple php hospital servey . ",
                "simple php supermarket  goods calculator. ",
                "simple php club members Subscription fees calculator. "
            ],
            "languages_Used": [
                "php",
                "Mysql",
                "phpmyadmin",
                "Html",
                "Css",
                "Bootstrap",
                "javascript"
            ],
            "links": {
                "Database operation": "http://evening-basin-25603.herokuapp.com/login.php",
                "Simple operation": "http://evening-basin-25603.herokuapp.com/Nti/task1/calc.php",
                "Medium operation": "http://evening-basin-25603.herokuapp.com/Nti/task3/bank/Bank.php"
            }
        },
        {
            "title": "en-gas",
            "subtitle": "<b style='color: rgb(255, 255, 0);'> Modern Template Design</b> <br> For En-gas Company ",
            "Project_Description": "Modern Template Design For En-gas Company with three pages Home, About us and Contact us ",
            "src": "media/eg-gas.jpg",
            "video_src": "https://www.youtube.com/embed/tgbNymZ7vqY",
            "Github_href": "https://github.com/abanoubsamirnaguib/eg-gas.github.io",
            "Demo_href": "https://abanoubsamirnaguib.github.io/eg-gas.github.io/www.EgyptianIndustrialCompany.com/layouts/services/electrician-home-page/home.html",
            "Project_Details": [
                "Pretty website for Egyptian Industry company with modern landing page .",
                "Fixed nav-bar which include the logo of the company and it’s name with page Title .",
                "Heading page with amazing design of company logo and name.",
                "Beautiful Button that make you navigate between the pages of the site  . ",
                "The product Button will move you seamlessly to the products inside the page .",
                "The contact us ,  about us button will take you to a separate page in a new tab to keep the home page and keep the products page opened .",
                "Beautiful card indicate the details of product include the product title , product image and description of the product .",
                "Modern footer with Social media links .",
                "About us page that indicate company story .",
                "Contact us page that have company contact number , email and address and From to send email to the company  ."
            ],
            "languages_Used": [
                "Html",
                "Css",
                "Uikit",
                "Bootstrap",
                "javascript"
            ],
            "links": {}
        },
        {
            "title": "Artist Abanoub",
            "subtitle": "Artist Abanoub Samir Official page",
            "Project_Description": "Artist Abanoub Samir Official page , you can find last music works and news and the last videos of Abanoub Samir ",
            "src": "media/ArtistAbanoubSamir.jpg",
            "video_src": "https://www.youtube.com/embed/tgbNymZ7vqY",
            "Github_href": "https://github.com/abanoubsamirnaguib/ArtistAbanoubSamir",
            "Demo_href": "https://abanoubsamirnaguib.github.io/ArtistAbanoubSamir/Home",
            "Project_Details": [
                "In vuejs project as frontend :-",
                "Header page with amazing design and beautiful color.",
                "Social media accounts fixed in all pages using component feature in vuejs.",
                "Message button with whatsapp, messenger, telegram that’s fixed in all pages using component feature in vuejs.",
                "Animated type text with beautiful shape.",
                "Sidebar moves you between pages seamlessly without reloading using the SPA Vuejs routes features.",
                "Beautiful animated logo.",
                "Dark-mood button which give you two themes (Dark , White ) . ",
                "Contact me page having contact me form with strong validation (in client-side and server-side) and response message after sending your message coming from the server and have open-closed boxes with animated typed-text and the artist information. ",
                "About me page that’s include the Biography with animated typed text and photo.",
                "My last work page include:- </br>- Beautiful slider and animated card with each song information related to the slider and you can add comment on each song without Authorization . </br>- Playlist with pretty media player for artist songs created by JavaScript  and vuejs functions with like and share features without Authorization. </br>- Slider and playlist media player related to each other ",
                "Video page include </br>- search bar to get videos faster </br> - getting videos from YouTube Api and get all information from YouTube .</br>- Video title in YouTube appear in bottom side of the page </br>- you can see videos in YouTube or in the page.</br>- Switch between videos left and right with pretty slider.</br>- comment section for adding comments at every video and see other comments.",
                "Latest News page </br>- getting all news or get news about specific topic (videos, music, events, social) .</br>- news date section with beautiful design </br>- like share and comment section without Authorization .",
                "Testimonials page with super design animating lighting title and customer experience with each customer picture in beautiful design.",
                "Photo page </br>- search bar to get photos faster. </br>- getting photos from Instagram API and get all information from Instagram.</br>- Instagram caption appear in the bottom of each photo by hover on the photo or by clicking in bottom button in small devices.</br>- viewing each photo in full screen size.</br>- comment section on each photo.",
                "All design created by vuejs and Vuetify Framework with routing system with spa feature.",
                "",
                "In Laraval project as backend ",
                "Dashboard with all results ",
                "Search bar in all pages.",
                "Website in Arabic and English.",
                "Login system for admin only.",
                "Breadcrumb in all pages.",
                "Sidebar having al pages.",
                "Saving photos and music tracks in Google drive using Google drive Api instead of putting them in website Host to save website host storage space. ",
                "Adding other admins to manage the websites.",
                "Using MYSQL database to store the website information.",
                "Using laravel ORM to connect database and models. ",
                "Testimonials page which you can see all Testimonials or add customer experience or modify existing one.",
                "News page which you can see all News or add news with date or modify existing one or search with specific category.",
                "Music page which you can listen and see all tracks or add new music track with it’s details or modify existing one or search for tracks with specific type based on (title , label and released ).",
                "Comments page which show all comments in website or add new comment on specific part or modify existing one or search for comment with specific type based on (music, video, photo and news).",
                "Contact me page to see all message coming from the frontend contact me page and can reply to each message with your email."
            ],
            "languages_Used": [
                "Html",
                "Css",
                "vuejs",
                "vuetify",
                "Bootstrap",
                "Youtube API",
                "Instagram API",
                "Google Drive API",
                "RESTFULL API",
                "php",
                "laravel 8",
                "blade template"
            ],
            "links": {
                "backend-laravel Github": "https://github.com/abanoubsamirnaguib/AS_Music_Backend",
                "backend-laravel Demo": "http://asmusicbackend-07251.herokuapp.com/public/login"
            }
        }
    ],
    "services": [
        {
            "title": "Web Design",
            "src": "media/2.72bf783e.jpg",
            "features": [
                {
                    "feature": "Photo Shop",
                    "photo": "<img src='media/photoshop.svg' alt='' width='50px' style='vertical-align: baseline;'>",
                    "description": "Photo Shop , Create Beautiful Images, Graphics, Paintings, and 3D Artwork on Your Desktop and iPad. If You Can Dream It, You Can Make It with Photoshop"
                },
                {
                    "feature": "Illustrator",
                    "photo": "<img src='media/illustrator.svg' alt='' width='50px' style='vertical-align: baseline;'>",
                    "description": "Adobe Illustrator is a professional vector-based design and drawing program. Used as part of a larger design workflow, Illustrator to create logos, patterns, icons,"
                },
                {
                    "feature": "Flicker",
                    "photo": "<i class='fas fa-atom' style='color: red;'></i>",
                    "description": "Flicker is used for create the illusion of more objects or colors/shades than are actually possible on the system, or as a speedy way of simulating transparency."
                }
            ]
        },
        {
            "title": "Web Development",
            "src": "media/1.850fe720.jpg",
            "features": [
                {
                    "feature": "HTML ,CSS ,javascript",
                    "photo": "<i class='fab fa-html5' style='color: rgba(0, 157, 255, 0.496);'></i>",
                    "description": "HTML is a markup language and CSS is a styling language. however, is a programming language. Hence, they are all web languages."
                },
                {
                    "feature": "Angular",
                    "photo": "<img src='media/angular-icon-1.svg' alt='' width='50px' style='vertical-align: baseline;'>",
                    "description": "Angular is a platform and framework for building single-page client applications using HTML and TypeScript. Angular is written in TypeScript."
                },
                {
                    "feature": "VUE",
                    "photo": "<i class='fab fa-vuejs' style='color: rgba(0, 255, 166, 0.696);'></i>",
                    "description": "Vue. js is a progressive framework for JavaScript used to build web interfaces and one-page applications. Vue. js is also used both for desktop and mobile app development."
                },
                {
                    "feature": "PHP , Laravel",
                    "photo": "<img src='media/php.svg' alt='' width='50px' style='vertical-align:baseline;'>",
                    "description": "Laravel, is incredibly scalable. Thanks to the scaling-friendly nature of PHP . In fact, Laravel applications have been easily scaled to handle hundreds of millions of requests per month."
                },
                {
                    "feature": "NOSQL DATBASE",
                    "photo": "<i class='fas fa-code-branch' style='color: rgb(255, 145, 0);'></i>",
                    "description": "NoSQL databases are non-tabular databases and store data differently than relational tables. NoSQL databases come in a variety of types based on their data model."
                },
                {
                    "feature": "MYSQL",
                    "photo": "<i class='fas fa-database' style='color: rgb(255, 187, 0);'></i>",
                    "description": "MySQL, the most popular Open Source SQL database management system, is developed and supported by Oracle Corporation.MySQL is a database management system."
                },
                {
                    "feature": "NODE JS",
                    "photo": "<img src='media/nodejs.png' alt='' width='50px' style='vertical-align:baseline;'>",
                    "description": "Node. js is primarily used for non-blocking, event-driven servers, It's used for traditional web sites and back-end API services, real-time, push-based architectures in mind."
                },
                {
                    "feature": "mongodb",
                    "photo": "<img src='media/mongodb.png' alt='' width='50px' style='vertical-align:baseline;'>",
                    "description": "MongoDB is built on a scale-out architecture that has become popular with developers.MongoDB makes it easy for developers to store structured or unstructured data."
                }
            ]
        },
        {
            "title": "Creative Design",
            "src": "media/3.741cffd5.jpg",
            "features": [
                {
                    "feature": "Creative Design",
                    "photo": "<img src='media/paint-palette-artist.png' alt='' width='50px' style='vertical-align:baseline;'>",
                    "description": "I Can generate graphics and digital animation which is designed to envision a future product. It also involves projects that are creative, powerful and unforgettable. It's about thinking out of the box to make it exclusive."
                },
                {
                    "feature": "Modern Looking ",
                    "photo": "<img src='media/paint-roller.png' alt='' width='50px' style='vertical-align:baseline;'>",
                    "description": "Web design is at the center of providing a satisfactory online experience. Modern web design has come a long way. No site stands a chance if it cannot look sophisticated and function flawlessly."
                }
            ]
        },
        {
            "title": "Responsive Design",
            "src": "media/4.6ac5afe4.jpg",
            "features": [
                {
                    "feature": "Bootstarp",
                    "photo": "<img src='media/bootstrap-4.svg' alt='' width='50px' style='vertical-align:baseline;'>",
                    "description": "Bootstrap includes a responsive, mobile first fluid grid system that appropriately scales up to 12 columns as the device or viewport size increases."
                },
                {
                    "feature": "uikit ",
                    "photo": "<i class='fab fa-uikit' style='color: rgba(0, 145, 255, 0.986);'></i>",
                    "description": "UIkit typically include the user interface components that convey meaning , Some kits may also provide a framework to underpin your site or app’s layout."
                },
                {
                    "feature": "Tailwind ",
                    "photo": "<img src='media/tailwind.svg' alt='' width='50px' style='vertical-align:baseline;'>",
                    "description": "What is Tailwind? The Tool That Feels Like a Marketing Team, Tailwind automates the most difficult parts of your social media marketing so you can grow smarter and faster. Save time with content creation."
                },
                {
                    "feature": "CSS3",
                    "photo": "<i class='fab fa-css3-alt' style='color: rgb(246, 255, 0);'></i>",
                    "description": "Responsive web design provides an optimal experience, easy reading and easy navigation with a minimum of resizing on different devices such as desktops, mobiles and tabs."
                }
            ]
        },
        {
            "title": "Branding Identity",
            "src": "media/5.e40574c5.jpg",
            "features": [
                {
                    "feature": "Branding",
                    "photo": "<i class='fas fa-copyright' style='color: rgb(112, 127, 128);'></i>",
                    "description": "Brand identity is the visible elements of a brand, such as color, design, and logo, that identify and distinguish the brand in consumers' minds. Brand identity is distinct from brand image. ... Designs its logo. Uses colors, shapes, and other visual elements in its products and promotions."
                }
            ]
        },
        {
            "title": "24/Support",
            "src": "media/6.da2598ca.jpg",
            "features": [
                {
                    "feature": "24/Support",
                    "photo": "<i class='fas fa-headset' style='color: rgba(78, 133, 174, 0.757);'></i>",
                    "description": "24/Support , support service that is provided 24 hours a day and 7 days a week. ... This support generally includes support for those services that require running without disruption and downtime."
                }
            ]
        }
    ]
}